Repository: ashaban/gofr-tz
Catalog: site/source/locales/*/LC_MESSAGES/user/sources.po
Languages: fr

source: Data Sources
fr: Sources de données

source: Note that there is a quick start in this documentation on how to upload CSV.
fr: Veuillez noter que vous trouverez dans la présente documentation un démarrage rapide sur la manière de télécharger un fichier CSV.

source: The tool supports CSV as a file source, as well as remote connections to DHIS2 and FHIR servers.
fr: L'outil prend en charge le fichier CSV comme fichier source, ainsi que toute connexion à distance aux serveurs DHIS2 et FHIR.

source: Upload CSV
fr: Télécharger un fichier CSV

source: The CSV file should have columns names in the first row of the file. Empty lines should be removed. The CSV file should be encoded as Unicode (utf-8) as that is what is used internally in the backend. If some entities are encoded in another format then matches that appear to be the same may not match as expected.
fr: Le nom des colonnes doit figuré sur la première rangée du fichier CSV. Les rangées vides doivent être supprimées. Le fichier CSV doit être encodé en format Unicode (utf-8) dans la mesure où c'est ce qui est utilisé en interne en backend. Si certaines entités sont encodées en format autre, alors les couplages qui semblent être identiques risquent de ne pas l'être comme escompté.

source: Latitude and longitude are optional columns. If they are included they will be used to facilitate manual matching but they are not used or required for automatic matching.
fr: Les colonnes de latitude et de longitude sont facultatives. Si elles sont incluses, elles seront utilisées pour faciliter le rapprochement manuel mais elles ne seront pas utilisées ni requises en mode automatique.

source: Once uploaded, in the View tab, CSV entries can be edited. Any edits do not modify the original data source but the edits will be exported after reconciliation.
fr: Une fois téléchargées, dans l'onglet de visualisation, les saisies CSV peuvent être modifiées. Aucune modification ne peut changer la source de données d'origine mais les modifications seront exportées après le rapprochement.

source: Select Levels
fr: Sélectionner les niveaux

source: The user may choose any levels in their hierarchy to include but they must be ordered with the top most level first.
fr: Les utilisateurs peuvent choisir d'inclure tout niveau de leur hiérarchie mais ils doivent être classés avec le niveau le plus élevé d'abord.

source: It is also possible to select no levels to match on a flat list with no hierarchy. To do so, don't select levels.
fr: Il est également possible de sélectionner aucun niveau pour coupler une liste plate sans hiérarchie. Pour ce faire, ne sélectionnez aucun niveau.

source: Remote Servers -- DHIS2 or FHIR
fr: Serveurs à distance -- DHIS2 ou FHIR

source: The tool supports remote sources. Any DHIS2 or FHIR server can be used as a source if the user has credentials to access it.
fr: L'outil prend en charge les sources à distance. Tout serveur DHIS2 ou FHIR peut être utilisé comme source si l'utilisateur est habilité à y avoir accès.

source: Extensive compatibility testing has not been performed but DHIS2 versions >=2.22 should be supported. Please contact the maintainers if there is an issue.
fr: Aucun test approfondi de compatibilité n'a été réalisé mais les versions de DHIS2 >=2.22 devraient être prises en charge. Veuillez contacter le service chargé de la maintenance en cas de problème.

source: FHIR is supported for STU3 and R4 support is anticipated. Other FHIR servers may be added in future versions of the tool, such as the HAPI FHIR server.
fr: FHIR est pris en charge pour STU3 et la prise en charge de R4 est anticipée. D'autres serveurs FHIR peuvent être ajoutés à des versions ultérieures de l'outil, tels que le serveur HAPI FHIR.
