Repository: ashaban/gofr-tz
Catalog: source/locales/*/LC_MESSAGES/roadmap.po
Languages: fr

source: Roadmap
fr: Feuille de route

source: Proposed features are managed in a publicly-viewable Google Doc and managed in GitHub issues.
fr: Les caractéristiques proposées sont prises en charge par un Google Doc publiquement visionnable et pris en charge par GitHub.

source: Timeline: February 2018 to July 2018, Status: Completed
fr: Calendrier : février 2018 à juillet 2018, statut : terminé

source: Features:
fr: Caractéristiques :

source: Matching based on one uploaded data source.
fr: Couplage réalisé sur la base d'une source de données téléchargée.

source: Other data source is one customized DHIS2 instance (GeoAlign).
fr: L'autre source de données est une instance DHIS2 (GeoAlign).

source: Preliminary DHIS2 authentication.
fr: Authentification préliminaire DHIS2.

source: Preliminary exports of matched and unmatched facilities.
fr: Exportations préliminaires de centres couplés et non couplés.

source: Timeline: August 2018 to October 2018, Status: Completed
fr: Calendrier : août 2018 à octobre 2018, statut : terminé

source: User-configurable to any data pair.
fr: Confirgurable par l'utilisateur à toute paire de données.

source: Any DHIS2 instance for which the user has access.
fr: Toute instance DHIS2 à laquelle l'utilisateur a accès.

source: Note: Version 0.2.0 was extensively production-tested on ~80K facilities.
fr: N.B. : la version 0.2.0 a été testée en production de manière approfondie dans près de 80 000 centres.

source: Timeline: November 2018 to December 2018, Status: Completed
fr: Calendrier : novembre 2018 à décembre 2018, statut : terminé

source: User interface overhaul.
fr: Remaniement de l'interface utilisateur.

source: Timeline: January 2019 to February 2019, Status: Completed
fr: Calendrier : janvier 2019 à février 2019, statut : terminé

source: Containerization.
fr: Containerisation.

source: Hosting scripts and utilities.
fr: Hébergement des scripts et des logiciels utilitaires.

source: Note: Version 0.3.0 was tested in user-centered design workshops using a cloud-hosted instance.
fr: N.B. : la version 0.3.0 a été testée lors d'ateliers de conception axés sur les utilisateurs avec une instance hébergée sur le nuage.

source: Timeline: March 2019 to April 2019, Status: Completed
fr: Calendrier : mars 2019 à avril 2019, statut : terminé

source: Documentation on facility-recon.readthedocs.org.
fr: Documentation sur facility-recon.readthedocs.org.

source: Enhanced export to show all matched and unmatched records.
fr: Exportation améliorée pour montrer tous les éléments appariés et non appariés.

source: Matching enabled on Facility IDs and Geo Coordinates.
fr: Couplage activé sur les identifiants des centres et leurs coordonnées géographiques.

source: Timeline: May 2019 to June 2019, Status: Completed
fr: Calendrier : mai 2019 à juin 2019, statut : terminé

source: Options for external authentication (DHIS2, iHRIS)
fr: Options d'authentification externe (DHIS2, iHRIS)

source: DHIS2 data source sharing.
fr: Partage des sources de données DHIS2.

source: DHIS2 pair sharing.
fr: Partage des paires DHIS2.

source: Easily-installable DHIS2 app.
fr: Appli DHIS2 facile à installer.

source: Configurable matching - matching based on parent constraint can be turned off
fr: Couplage configurable, basé sur une contrainte parent pouvant être désactivée

source: Timeline: TBD, Status: In-progress
fr: Calendrier : à déterminer, statut : en cours

source: Preparation for 1.0 release.
fr: Préparation du lancement de 1.0.

source: Extensive end-to-end testing.
fr: Test approfondi de bout en bout.

source: Bugs resolved.
fr: Bugs réglés.

source: Updated FHIR version.
fr: Version de FHIR mise à jour.

source: Consider moving to HAPI FHIR.
fr: Passage à HAPI FHIR envisagé.
