Repository: ashaban/gofr-tz
Catalog: source/locales/*/LC_MESSAGES/dev/dhis2users.po
Languages: fr

source: DHIS2 users and sharing
fr: Utilisateurs et partage de DHIS2

source: With DHIS2 set as the authentication layer, users from DHIS2 can be given access to particular data sources and pairs, be restricted to pairs, and have their organizational unit restrictions also be reflected in the Facility Reconciliation Tool.
fr: Avec DHIS2 comme couche d'authentification, les utilisateurs de DHIS2 peuvent se voir accorder l'accès à des sources et paires de données particulières, être restreints à certaines paires et faire en sorte que les restrictions de leurs unités organisationnelles se retrouvent également dans l'outil de rapprochement des centres.

source: Prequisites
fr: Préalables

source: The Facility Reconciliation Tool application must be running.
fr: L'application de rapprochement des centres doit être en marche.

source: Then, the app should be installed. See the developer guide page for DHIS2 app installation.
fr: Ensuite, l'appli doit être installée. Cf. page du guide du développeur pour l'installation de l'appli DHIS2.

source: Once DHIS2 is the authentication layer, users must exist in DHIS2 for them to be able to use the Facility Reconciliation App.
fr: Une fois que DHIS2 est une couche d'authentification, les utilisateurs doivent exister dans DHIS2 pour pouvoir utiliser l'appli de rapprochement des centres.

source: About DHIS2 users
fr: À propos des utilisateurs DHIS2

source: The building blocks of user management in DHIS2 are authorities, users, user roles, and user groups. See the latest DHIS2 documentation for an overview which is partly reproduced here.
fr: Les éléments constitutifs de la gestion des utilisateurs dans DHIS2 sont les autorités, les utilisateurs, les rôles des utilisateurs et les groupes d'utilisateurs. Cf. la dernière documentation DHIS2 en date pour un aperçu qui est en partie reproduit dans le présent.

source: Configuration options
fr: Options de configuration

source: When the Facility Reconciliation DHIS2 App is installed and DHIS2 is selected as an authentication source, a DHIS2 superuser role must be selected. There are several additional options.
fr: Lorsque l'appli DHIS2 de rapprochement des centres est installée et que DHIS2 est sélectionné comme source d'authentification, un rôle de superutilisateur DHIS2 doit être sélectionné. Il existe plusieurs autres options.

source: In the default settings:
fr: Dans les paramètres par défaut :

source: Users will be able to only see the org units they have permission to see in DHIS2.
fr: Les utilisateurs seront en mesure de ne voir que les unités organisationnelles qu'ils ont la permission de voir dans DHIS2.

source: Org units can be pulled into the Facility Reconciliation Tool into a dataset named as desired.
fr: Les unités organisationnelles peuvent être intégrées à l'outil de rapprochement des centres dans un ensemble de données du nom de votre choix.

source: Org units can be shared to users and not just the user who configured the system.
fr: Les unités organisationnelles peuvent être partagées entre plusieurs utilisateurs et pas uniquement associées à l'utilisateur qui a configuré le système.

source: The default configurations may be switched on or off as desired.
fr: Les configurations par défaut peuvent être activées ou non, comme vous le souhaitez.

source: Share data sources
fr: Partager des sources de données

source: Any existing data source can be shared to a DHIS2 user that has permission to use the app. One may share a dataset to particular users or all users or to limit the dataset based on the organization unit attached to DHIS2.
fr: Toute source de données existante peut être partagée avec un utilisateur DHIS2 qui dispose de la permission d'utiliser l'appli. Il est possible de partager un ensemble de données avec des utilisateurs particuliers ou avec tous les utilisateurs ou encore de limiter l'ensemble de données sur la base de l'unité organisationnelle associée à DHIS2.

source: Click on the Data Sources tab and choose to View Data Sources.
fr: Cliquez sur l'onglet de sources de données et choisissez affichage des sources de données.

source: Sharing status is listed for each data source and if not being shared it is blank.
fr: Le statut de partage est indiqué pour chaque source de données et dans le cas contraire, il est vierge.

source: Click on the share button to bring up the menu.
fr: Cliquez sur le bouton de partage pour faire apparaître le menu.

source: Sharing can be limited by either or both the user or location (DHIS2 org unit).
fr: Le partage peut être limité en fonction des utilisateurs ou des emplacements (unités organisationnelles DHIS2).

source: Share data pairs
fr: Partager des paires de données

source: Data sharing of pairs is similar to that of data sources.
fr: Le partage de paires de données est semblable à celui des sources de données.

source: Go to the Reconcile tab and select Create and Manage Data Source Pair.
fr: À partir de l'onglet de rapprochement, sélectionnez créer et gérer une paire de sources.

source: This page lists the pairs and is where to create pairs. In this example, we have two data sources from the DHIS2 currently being used and one for a remote DHIS2.
fr: Cette page dresse la liste des paires et est l'endroit où les paires sont créées. Dans cet exemple, nous avons deux sources de données de DHIS2 actuellement utilisées et une pour un DHIS2 à distance.

source: The sharing status can be seen in the list data pairs.
fr: Le statut de partage peut être vu sur la liste des paires de données.

source: Click the Share button on the right hand side of the data source in the list to expand the pair sharing menu.
fr: Cliquez sur le bouton de partage à droite de la source de données dans la liste pour faire apparaître le menu de partage des paires.
