Repository: ashaban/gofr-tz
Catalog: source/locales/*/LC_MESSAGES/dev/dhis2app.po
Languages: fr

source: DHIS2 app installation
fr: Installation de l'appli DHIS2

source: DHIS2 is a popular open source and open standards-based HMIS in global health. The Facility Reconciliation Tool can be installed as a DHIS2 app and configured as required to restrict users to the organization units they need to access.
fr: DHIS2 est un HMIS de source ouverte basé sur des normes dans le domaine de la santé dans le monde. L'outil de rapprochement des centres peut être installé sous la forme de l'appli DHIS2 et configuré de manière convenable afin de restreindre les utilisateurs aux unités de l'organisation auxquelles ils ont besoin d'avoir accès.

source: Features
fr: Caractéristiques

source: The Facility Reconciliation DHIS2 App has the ability to:
fr: L'appli de rapprochement des centres DHIS2 a la capacité de :

source: Authenticate only using DHIS2 users and roles.
fr: Authentifier uniquement à l'aide des utilisateurs DHIS2 et de leurs rôles.

source: Add DHIS2 users to data sources and data pairs.
fr: Ajouter des utilisateurs DHIS2 aux sources de données et aux paires de données.

source: Restrict DHIS2 users to specific data pairs or one pair.
fr: Restreindre les utilisateurs DHIS2 à une ou plusieurs paires de données particulières.

source: Restrict users to specific organizational units in DHIS2 and have this reflected in access in the Facility Reconciliation Tool.
fr: Restreindre les utilisateurs à des unités particulières de l'organisation dans DHIS2 et faire en sorte que cela soit reflété dans l'accès à l'outil de rapprochement des centres.

source: Install DHIS2 app on the same server running DHIS2
fr: Installer l'appli DHIS2 sur le même serveur qui prend en charge DHIS2

source: For the Facility Reconciliation Tool to be used as a DHIS2 app, the standalone tool itself must be installed. It is expected that the tool is installed on the same server as DHIS2.
fr: Pour que l'outil de rapprochement des centres soit utilisé sous la forme de l'appli DHIS2, l'outil indépendant doit être installé. L'outil doit être installé sur le même serveur que DHIS2.

source: Clone the GitHub repository.
fr: Clonez le repositaire GitHub.

source: Log in as an admin in DHIS2 with permission to install apps. Open the app called App Management.
fr: Accédez à DHIS2 comme administrateur avec la permission d'installer des applis. Ouvrez l'appli intitulée App Management (gestion des applis)

source: Choose to install an app using the button on the far right.
fr: Choisissez d'installer une appli à l'aide du bouton tout à droite.

source: A file chooser will open. Select the already packaged .zip file in the GitHub repository folder dhis2App.
fr: Une fenêtre de navigation des fichiers s'ouvrira. Choisissez le fichier .zip déjà empaqueté dans le repositaire le dossier GitHub dhis2App.

source: To install the app on the DHIS2 demo playground you need a different package, see modifications below.
fr: Pour installer l'appli que le terrain de jeu de démo DHIS2, vous aurez besoin d'un autre paquet, cf. modifications ci-dessous.

source: To point the app at another server for the backend you need a different package, see modifications below.
fr: Pour orienter l'appli vers un autre serveur pour le backend, vous aurez besoin d'un paquet différent, cf. modifications ci-dessous.

source: Now the DHIS2 app is installed. Confirm:
fr: L'appli DHIS2 est maintenant installée. Confirmez :

source: After installing the app but before setting up DHIS authentication, set the user role in DHIS2 to have permissions.
fr: Après avoir installé l'appli mais avant la configuration de l'authentification DHIS, réglez le rôle de l'utilisateur dans DHIS pour qu'il ait des permissions.

source: Add app permission to User Role
fr: Ajoutez des permissions pour l'appli au rôle d'utilisateur

source: External authentication works by associating a DHIS2 user role. The Facility Reconciliation Tool must know the user role. The user role that is selected to manage the tool must have permissions added otherwise if it is not then the user will be locked out.
fr: L'authentification externe fonctionne en associant un rôle d'utilisateur DHIS2. L'outil de rapprochement des centres doit connaître le rôle de l'utilisateur. Le rôle de l'utilisateur sélectionné pour gérer l'outil doit disposer de permissions ajoutées, sinon l'utilisateur sera bloqué.

source: Click on the Users app in the app menu dropdown.
fr: Cliquez sur l'appli utilisateurs dans le menu déroulant de l'appli.

source: In the users app menu, select User Roles.
fr: Dans le menu de l'appli des utilisateurs, sélectionnez rôle des utilisateurs.

source: Select the name of the user role you will use to manage the Facility Reconciliation App. This will take you to a detailed view of the authorities granted to that user role.
fr: Sélectionnez le nom du rôle d'utilisateur que vous utiliserez pour prendre en charge l'appli de rapprochement des centres. Vous serez envoyer vers un affichage détaillé des autorités octroyées à ce rôle d'utilisateur.

source: Under Apps check the box next to Facility Reconciliation app.
fr: Sous Applis, cochez la case à côté de l'appli de rapprochement des centres.

source: Click Save at the bottom on the page to submit the change.
fr: Cliquez sur Sauvegarder au bas de la page pour soumettre la modification.

source: Setup DHIS2 authentication
fr: Paramétrage de l'authentification DHIS

source: Back on the apps dropdown, click on the now-installed Facility Reconciliation app icon to finish configuration and setup authentication.
fr: Dans le menu déroulant des applis, à nouveau, cliquez sur l'icône de l'appli de rapprochement des centres désormais installée afin de terminer la configuration et la paramétrage de l'authentification.

source: Under Configure Settings turn on external authentication. Select DHIS2 as the authentication point.
fr: Sous Paramètres de configuration, activez l'authentification externe. Sélectionnez DHIS2 comme point d'authentification.

source: Select the superuser role in DHIS2 that will be used to administer facility reconciliation.
fr: Sélectionnez le rôle de superutilisateur dans DHIS2 qui sera utilisé pour prendre en charge le rapprochement des centres.

source: Then, enter a username and password that the backend will use to pull data from DHIS2.
fr: Puis, saisissez un nom d'utilisateur et un mot de passe que le backend pourra utiliser pour extraire des données auprès de DHIS2.

source: Select Pull to get data into the app. This is necessary for two-way communication to work between the app and the reconciliation backend.
fr: Sélectionnez Extraire pour alimenter l'appli en données. Cela est nécessaire au bon fonctionnement de la communication à deux sens entre l'appli et le backend du rapprochement.

source: Once the app is done it will redirect to the data sources view to confirm the DHIS2 data source is now there.
fr: Une fois que l'appli a terminé, elle réoriente vers l'affichage des sources de données pour une confirmation de la présence de la source de données DHIS2.

source: Install DHIS2 app on DHIS playground
fr: Installez l'appli DHIS2 sur le terrain de jeu DHIS2.

source: The Facility Reconciliation Tool should be running. A quick way to do this for a demo is to use Docker.
fr: L'outil de rapprochement des centres doit être en marche. Une manière rapide de ce faire pour une démonstration consiste à utiliser Docker.

source: Visit https://play.dhis2.org and select a DHIS2 demo version.
fr: Consultez https://play.dhis2.org et sélectionnez une version de démonstration de DHIS2.

source: Follow the above recipe but use the prebuilt version designed for DHIS2 playground.
fr: Suivez les consignes ci-dessus mais utilisez la version précréée conçue pour le terrain de jeu DHIS2.

source: Then follow the rest of the recipe above.
fr: Puis suivez le reste des consignes ci-dessus.

source: Setup a different backend server
fr: Installer un serveur backend différent

source: If the DHIS2 app must talk to a backend that is on another server, then the prebuilt package is not suitable and must be rebuilt with the correct address.
fr: Si l'appli DHIS2 doit communiquer avec un backend qui se trouve sur un autre serveur, le paquet préconçu ne convient alors pas et doit être reconstitué avec l'adresse correcte.

source: The file /facility-recon-gui/config/prod.env.js must be modified.
fr: Le fichier /facility-recon-gui/config/prod.env.js doit être modifié.

source: Change the BACKEND_SERVER variable to the server. For example, for localhost:
fr: Modifiez la variable BACKEND_SERVER avec le serveur qui convient. Par exemple, pour localhost :

source: Once the file is edited and saved, build the gui.
fr: Une fois que le fichier a été modifié et sauvegardé, constituez le gui.

source: The new app is installed in the root as /dhis2App/GOFR.zip. This is now built with the server chosen in the above step and can be installed into DHIS2.
fr: La nouvelle appli est installée dans la racine sous /dhis2App/GOFR.zip. Cela est désormais intégré au serveur choisi lors de l'étape ci-dessus et peut être installé dans DHIS2.
