Repository: ashaban/gofr-tz
Catalog: source/locales/*/LC_MESSAGES/dev/docs.po
Languages: fr

source: Update and Build Documentation
fr: Mettre à jour et constituer la documentation

source: These docs are hosted at https://readthedocs.io. The documentation is built using Sphinx with Markdown support enabled. In order to translate, the documentation must first be in the base (English) language. Upon a successful build, the translatable files (.pot) are then pushed to Transifex. The pot files must be synchronized with Transifex for editors to use them.
fr: Ces documents sont hébergés sur https://readthedocs.io. La documentation est constituée à l'aide de Sphinx, le soutien Markdown étant activé. Pour traduire, la documentation doit avant tout être en langue de base (anglais). Une fois la création réussie, les fichiers traduisibles (.pot) sont envoyés sur Transifex. Les fichiers pot doivent être synchronisés avec Transifex pour que les éditeurs puissent les utiliser.

source: Simple Build
fr: Construction simple

source: Install prerequisites (see below). Then to do a build:
fr: Installez les prérequis (cf. ci-dessous). Puis procédez à une création.

source: Sphinx Extensions
fr: Extensions Sphinx

source: Python extensions are required to build the docs, including sphinx_markdown_tables for tables to render. The .readthedocs.yaml file in the root of the repo sets which version of Python (3.7) and the location of the requirements file in docs/requirements.txt.
fr: Les extensions Python sont requises pour la constitution de docs, y compris sphinx_markdown_tables pour les tables à traduire. Le fichier .readthedocs. yaml dans la racine du repo détermine la version de Python (3.7) et l'emplacement du fichier requis dans docs/requirements.txt.

source: For more on how markdown tables can render correctly see: https://pypi.org/project/sphinx-markdown-tables/
fr: Pour davantage de renseignements sur la manière dont les tableaux markdown peuvent traduire correctement, cf. : https://pypi.org/project/sphinx-markdown-tables/

source: Update Sources for Translation
fr: Mise à jour des sources de traduction

source: This is from the rtd docs with minor changes for folder names.
fr: Cela provient des docs rtd avec des changements mineurs pour les noms de dossiers.

source: This should be done if content changes in the base language documentation.
fr: Cela doit être fait si le contenu change dans la documentation de la langue de base.

source: Create the .pot files.
fr: Créez les fichiers .pot.

source: Push files to Transifex.
fr: Envoyez les fichiers sur Transifex.

source: Build Documentation from New Translations
fr: Constituer la documentation pour de nouvelles traductions

source: Next git add, commit, push the changes to the repository master branch. Then rebuild the English and French projects on readthedocs.org.
fr: Puis ajoutez, engagez git, soumettez les changements à la branche master du repositaire. Puis reconstituez les projets anglais et français sur readthedocs.org.

source: Update Base (English) Documentation
fr: Mise à jour de la documentation de base (en anglais)

source: Note: Python 3.x is expect in the Makefile.
fr: N.B. : Python 3.x est escompté dans le Makefile.

source: Install prerequisites:
fr: Installation des prérequis :

source: Clone the respository, create a branch, and enter the docs directory. (If you are not a maintainer, please fork, branch, then send a pull request.)
fr: Clonez le référentiel, créez une branche et saisissez le répertoire des docs. (Si vous n'êtes pas l'éditeur, veuillez procéder à l'autoclonage, à l'embrachement et ensuite envoyez une demande d'extraction).

source: Build the documentation. There is no need to commit documentation builds. The .gitignore includes the built documentation so built docs will not be committed by default. readthedocs builds the hosted documentation itself.
fr: Établissez la documentation. Il n'est pas nécessaire d'engager la constitution de la documentation. Le .gitignore inclut la constitution de documentation, ainsi les documents construits ne seront pas engagés par défaut. redthedocs constitue la documentation hébergé lui-même.

source: Build docs in default (English) language.
fr: Créez les docs en langue par défaut (anglais).

source: Built docs will go in the /docs/build directory. Open /docs/build/index.html in a browser to see the built docs.
fr: Les documents développés iront dans le répertoire /docs/build. Ouvrez /docs/build/index.html dans un navigateur pour voir les documents.

source: Transifex Setup
fr: Installation de Transifex

source: Transifex provides an accessible interface for contributors to enter and correct translations. The workflow is explained at readthedocs.
fr: Transifex offre une interface accessible qui permet aux contributeurs de saisir et corriger les traductions. Le flux de travail est expliqué sur readthedocs.

source: Setup an account on transifex.com. Be added to the OpenHIE organization for facility-recon project. Obtain a token in user settings and initialize transifex command line client. You do not need to tx init the directly, as the .tx/config should be version control. Setup a $TFX_TOKEN environment variable for yourself.
fr: Créez un compte sur transifex.com. Soyez ajouté à l'organisation OpenHIE pour le projet facility-recon. Obtenez un jeton dans les configurations de l'utilisateur et initialisez le client de ligne de commande transifex. Vous n'avez pas besoin de tx init directemment, dans la mesure où la version de .tx/config devrez avoir été contrôlée. Installez l'environnement variable $TFX_TOKEN pour vous-même.

source: Create Translation Intermediate Files for New Languages
fr: Créer des fichiers de traduction intermédiaires pour de nouvelles langues

source: In the /docs directory, create the locale files. Use the appropriate locale. Note that Sphinx supports less locales than Transifex.
fr: Dans le répertoire /docs, creéz les fichiers de paramètres locaux. Utilisez le paramètre local qui convient. Veuillez noter que Sphinx prend en charge moins de paramètres locaux que Transifex.

source: How Localization was done (Do Not Reproduce)
fr: La manière dont la localisation a été faite (à ne pas reproduire)

source: Do not replicate this process. It is here to document how it was done in the first place. Doing it again would delete or write over translations or remove them.
fr: Ne répétez pas ce process. Il a pour but de documenter la manière dont il se fait en premier en lieu. Toute répétition supprimerait les traductions, les modifierait ou les effacerait.

source: Setup Sphinx for the project. Enable Markdown support. Setup readthedocs.org. Enable the webhook to trigger builds.
fr: Installez Sphinx pour le projet. Activez le soutien Markdown. Installez readthedocs.org. Activez le point d'accueil Web pour enclencher la constitution.

source: Create the source language docs.
fr: Créez les documents dans la langue source.

source: Create projects in readthedocs.org for both the source language (facility-recon - no prefix/suffix) and the new one (facility-recon-fr)
fr: Créez des projets dans readthedocs.org pour la langue source (facility-recon - sans préfixe ni suffixe) et le nouveau fichier (facility-recon-fr)

source: Set languages correctly on both projects.
fr: Affectez les langues qui conviennent aux deux projets.

source: Assign the -fr project as a translation of the source. You must have two projects.
fr: Affectez le projet -fr comme traduction de la source. Vous devez avoir deux projets.

source: Create gettest dir. source is required as the conf.py file is not in the docs directory.
fr: La création d'une source gettest dir. est requise dans la mesure om le fichier conf.py ne se trouve pas dans le répertoire de documents.

source: Create .pot files for French. This puts a locales directory in /docs/source/ and creates files for every .md and .rst file.
fr: Créez des fichiers .pot pour le français. Cela met un répertoire local dans /docs/source/ et crée des fichiers pour chaque fichier .md et .rst.

source: Init Transifex support for the repo. Do it from the repo root, not docs. Add a Transifex API token env var prior to doing this.
fr: Init soutien Transifex pour le repo. Faites-le à partir de la racine repo, et non pas des docs. Ajoutez une var env jeton API Transifex pou ce faire.

source: Bulk-map all of the documents. This must be done in the root of the repo.
fr: Mappez tous les documents. Cela doit être fait dans la racine du repo.

source: Do the initial push of the source language documents to Transifex.
fr: Procédez au lancement initial des documents de langue source sur Transifex.

source: Test by translating and editing a few files on Transifex. Pull from Transifex.
fr: Testez en traduisant et en révisant quelques fichiers sur Transifex. Extrayez de Transifex.

source: Manually check the .po files translated to confirm the changes.
fr: Vérifiez de manière manuelle les fichiers .po traduits pour confirmer les modifications.

source: Build locally to check. (FYI, this puts .mo files into the repo which could potentially be gitignored and removed.)
fr: Développez localement pour vérifier. (Pour information, les fichiers .mo sont placés dans le repo et ils pourraient donc potentiellement être gitignorés ou supprimés).

source: ...then open the index.html in the built files for French to confirm.
fr: ...puis ouvrez le fichier index.html dans les fichiers pour le français pour confirmer.

source: readthedocs.io should rebuild based on the existing webhook.
fr: readthedocs.io doit être reconstitué sur la base du poitn d'accueil Web existant.
