Repository: ashaban/gofr-tz
Catalog: docs/source/locales/*/LC_MESSAGES/dev/ansible.po
Languages: fr

source: These steps are for installing on a server OS directly and require experience with remote configuration.
fr: Ces étapes s'appliquent à l'installation directe sur un serveur OS et exige une expérience en configuration à distance.

source: To use Ansible, your SSH public key should be in .ssh/authorized_keys on the remote host and you must also create an /etc/ansible/hosts or similar with the IP address or hostname of the remote host. An ansible/hosts file that has an entry for localhost and one server would be:
fr: Pour utiliser Ansible, votre clé SSH publique doit être dans .ssh/authorized_keys sur l'hébergement à distance et vous devez également créer un /etc/ansible/hosts ou semblable avec l'adresse IP ou le nom de l'hébergement à distance. Un fichier Ansible/hébergement qui dispose d'une entrée pour l'hébergement local et un serveur doit être :

source: SSH setup
fr: Installation SSH

source: A example playbook is provided to show how to create a fr user with sudo permissions using Ansible to be used with VM. See /packaging for Terraform (Digital Ocean) and Vagrant (CentOS 7 and Ubuntu 18) for working examples.
fr: Un modèle de playbook est fourni pour vous montrer comment créer un utilisateur fr doté de permissions sudo à l'aide d'Ansible à utiliser avec la mémoire virtuelle. Cf. /packaging pour Terraform (Digital Ocean) et Vagrant (CentOS 7 et Ubuntu 18) pour des exemples qui fonctionnent.

source: Create a VM. Make sure to include a public ssh key for the user who will install prerequisites.
fr: Créez une mémoire virtuelle. Assurez-vous d'inclure une clé ssh publique pour l'utilisateur qui installera les prérequis.

source: Create the fr user and gives it sudo access:
fr: Créez un utilisateur fr et octroyez-lui un accès sudo :

source: As necessary, add additional ssh keys to the user fr. (Ensure that the user's public key is available on github, ie. https://github.com/citizenrich.keys):
fr: En fonction des besoins, ajoutez des clés ssh pour l'utilisateur fr. (Assurez-vous que la clé publique de l'utilisateur est disponible sur github, c'est-à-dire https://github.com/citizenrich.keys) :

source: Prerequisites: git, redis, mongo, nodejs, native build pkgs for node:
fr: Prérequis : git, redis, mongo, nodejs, paquets de construction natives pour nœud :

source: Install the services and load and start them in systemd:
fr: Installez les services, chargez-les et démarrez-les dans le système :

source: Troubleshooting
fr: Résolution de problème

source: Check that all processes are running and see the latest status for hearth and the backend:
fr: Vérifiez que tous les process tournent ainsi que le dernier statut en date pour hearth et backend :

source: Upgrades
fr: Mises à niveau

source: Rerunning the install playbook updates intrahealth/hearth and app repos on the remote server. Rerunning the services.yaml playbook updates services. Services are restarted (not just reloaded).
fr: Relancez l'installation des mises à jour de playbook intrahealth/hearth et appli repos sur le serveur à distance. Relancez les services de mise à jour de playbook services. yaml. Les services sont réinitialisés (pas simplement retéléchargés).

source: The install.yaml playbook uses:
fr: Le playbook install.yaml utilise :

source: git pull to get the latest updates to the master branch.
fr: Utilisez git pull pour obtenir les dernières mises à jour en date pour la branche master.

source: npm install to update packages.
fr: Installation npm pour la mise à jour des packages.

source: Basic status
fr: Statut de base

source: Logs
fr: Connexions

source: Restart services
fr: Redémarrage des services

source: Restart databases
fr: Redémarrez les bases de données

source: Networking
fr: Mise en réseau

source: Ensure processes are listening on the correct ports: See https://serverfault.com/questions/725262/what-causes-the-connection-refused-message
fr: Assurez-vous que les process écoutent sur les ports qui conviennent : cf. https://serverfault.com/questions/725262/what-causes-the-connection-refused-message

source: Check for firewall blocks. Rerun the gui and:
fr: Vérifiez qu'il n'y ait pas de blocage de pare-feu. Relancez le gui et :
