Repository: ashaban/gofr-tz
Catalog: docs/source/locales/*/LC_MESSAGES/dev/install.po
Languages: fr

source: Install Locally
fr: Installation locale

source: Hearth (FHIR Server) Installation
fr: Installation de Hearth (Serveur FHIR)

source: Make sure mongo 3.6 or above is installed and running before proceeding with below instructions
fr: Assurez que mongo 3.6 ou une version ultérieure est installé et lancé avant de suivre les consignes suivantes

source: Open the config file located under config/default.json and disable authentication by setting authentication type to disabled i.e "authentication": { "type": "disabled"}
fr: Ouvrez le fichier de config situé sous config/default.json et désactivez l'authentification en configurant le type d'authenfication en mode désactivé, c'est-à-dire "authentication": { "type": "disabled"}

source: Start hearth
fr: Démarrez Hearth

source: Download the repo.
fr: Téléchargez le repo.

source: Install and run Redis
fr: Installez et lancez Redis

source: Run the backend
fr: Faites tourner backend

source: DHIS2 App (Optional)
fr: Appli DHIS2 (facultative)

source: Note that the DHIS2 app is not required for running the tool as it can be run standalone from the GUI.
fr: Veuillez noter que l'appli DHIS2 n'est pas requise pour le fonctionnement de l'outil dans la mesure où il peut fonctionner indépendemment du GUI.

source: Copy the frontend build contents from facility-recon/facility-recon-gui/dist into facility-recon/dhis2App/ and then zip the content of of dhis2App
fr: Copiez les contenus constitués sur le frontend de facility-recon/facility-recon-gui/dist à facility-recon/dhis2App/ puis zippez le contenu de dhis2App

source: Login to DHIS2 and install the zipped file (GOFR.zip)
fr: Connectez-vous à DHIS2 et installez le fichier zippé (GOFR.zip)
