Repository: ashaban/gofr-tz
Catalog: docs/source/locales/*/LC_MESSAGES/faq.po
Languages: fr

source: Is there an API?
fr: Existe-t-il une API ?

source: The tool uses a FHIR server, Hearth for persistent storage. Hearth uses MongoDB for its storage layer.
fr: L'outil utilise un serveur FHIR, Hearth pour un stockage persistant. Hearth utilise MongoDB comme couche de stockage.

source: To obtain data sources and reconciled sources a user with access to the underlying stack can make queries to MongoDB or to the FHIR-based REST API for Hearth. There is no authentication for the raw access in this manner.
fr: Pour obtenir des sources de données et procéder au rapprochement, les utilisateurs ayant accès à la pile sous-jacente peuvent interroger MongoDB ou l'API REST basée sur FHIR pour Hearth. Aucune authentification n'est nécessaire pour l'accès brut de cette manière.

source: Can this tool be used in education or agriculture?
fr: Cet outil peut-il être utilisé dans les secteurs éducatif et agricole ?

source: Yes! The tool was first created for the health sector and uses the FHIR standard based on the mCSD IHE profile.
fr: Oui ! Cet outil a été créé pour le secteur de la santé et utilise la norme FHIR basée sur le profil mCSD IHE.

source: Any hierarchical location list can potentially be supported. The backend representation can be exported in CSV and others may be added as use cases dictate.
fr: Toute liste d'emplacements hiérarchiques peut être potentiellement prise en charge. La représentation dorsale peut être exportée en format CSV et d'autres peuvent être ajoutées en fonction des cas d'utilisation.

source: Does the tool clean the source data?
fr: L'outil nettoye-t-il les données sources ?

source: No. The tool takes a pair of sources and uses automatic and manual methods to identify matches. If there are corrections needed, the tool can export a CSV or FHIR representation of what was and was not matched. The data sources have to be cleaned outside of the tool.
fr: Non. Cet outil prend une paire de sources et utilise des méthodes automatiques et manuelles afin d'identifier des correspondances. Si des corrections sont nécessaires, l'outil peut exporter un CSV ou une représentation FHIR de ce qui est couplé et ce qui ne l'est pas. Ces sources de données doivent être nettoyées à l'extérieur de l'outil.

source: If this is a feature for your use case, please get in touch.
fr: Si cette caractéristique s'applique à votre cas d'utilisation, veuillez nous contacter.

source: Can I run the tool on my own PC?
fr: Puis-je utiliser l'outil sur mon propre ordinateur personnel ?

source: The tool is comprised of four components: the app itself, Redis as an in-memory database for performance, the Hearth FHIR server, and MongoDB which is used by both Hearth for storing resources and the app for managing state.
fr: Cet outil compte quatre composantes : l'application à proprement parler, Redis, une base de données mémoire pour la performance, le serveur FHIR Hearth et MongoDB qui est utilisé aussi bien par Hearth pour le stockage des ressources que par l'application pour la gestion

source: The tool is designed to be hosted on a server, either locally or in the cloud. The tool supports user management and is meant to be available for many users to collaborate on matching facility lists. Server installation is the recommended way to deploy the tool.
fr: Cet outil est conçu de manière à être hébergé sur un serveur local ou sur le nuage. Cet outil prend en charge la gestion des utilisateurs et est censé être mis à la disposition de nombreux utilisateurs pour leur permettre de collaborer sur le rapprochement des listes des centres. L'installation serveur est recommandée pour le déploiement de l'outil.

source: Docker is not recommended as by default it will not persist the data, meaning that when you stop Docker you lose your data. This can be changed by mounting a volume to store data. But, the tool is meant as a platform for multiple users to collaborate on matching. It can be deployed on a server using Docker but the administrator should be careful to mount a volume to ensure data persistence.
fr: Docker n'est pas recommandé par défaut dans la mesure où il ne permettra pas aux données de persister, ce qui veut dire que lorsque vous arrêtez Docker, vous perdez vos données. Cela peut être modifié par la création d'un volume pour stocker les données. Mais l'outil est censé être utilisé comme plateforme permettant à de multiples utilisateurs de collaborer sur le couplage. Il peut être déployé sur un serveur à l'aide de Docker mais l'administrateur doit prendre garde de créer un volume pour assurer la persistance des données.

source: Developers may install the stack directly but this is not for production.
fr: Les développeurs peuvent installer les piles directement mais cela ne s'applique pas à la production.
