Repository: ashaban/gofr-tz
Catalog: site/source/locales/*/LC_MESSAGES/quick/quick-dhis2.po
Languages: fr

source: Add DHIS2 source
fr: Ajouter une source DHIS2

source: This example uses the DHIS2 Playground which is already loaded with fake but realistic facility data.
fr: Cet exemple utilise le terrain de jeu DHIS2 (Playground) qui contient déjà des données fictives, toutefois réalistes, sur un centre.

source: Configure DHIS2 Data Source
fr: Configurer une source de données DHIS2

source: To connect to any DHIS2, you need a username and password and the URL (website address) of the DHIS2. This example uses the demo playground provided username and password.
fr: Pour vous connecter à tout système DHIS2, vous aurez besoin d'un nom d'utilisateur, d'un mot de passe et de l'URL (adresse Internet) du système DHIS2. Cet exemple utilise le nom d'utilisateur et le mot de passe fournis par le terrain de jeu de démonstration.

source: Any DHIS2 server can be used as a source for which the user can authenticate and is authorized to get the facility and hierarchy.
fr: Tout serveur DHIS2 peut être utilisé comme source pour laquelle l'utilisateur peut s'authentifier et est autorisé à accéder au centre et à la hiérarchie.

source: The Base URL is the website for the DHIS2. The example URL for the playground may be a bit confusing because it has '/2.31.3' but that is because the playground is hosting many DHIS2 versions at the same address like '/2.32' etc. In other DHIS2, there will be no '/version'.
fr: L'URL de base est le site Web du système DHIS2. L'URL donnée en exemple dans le terrain de jeu peut prêter à confusion quelque peu parce qu'il contient /2.31.3, la raison étant que le terrain de jeu héberge de nombreuses versions du système DHIS2 à la même adresse tels que /2.32, etc. Dans d'autres systèmes DHIS2, il n'y aura pas de /version.

source: Open the Facility Reconciliation Tool. Select 'Data Sources'
fr: Ouvrez l'outil de rapprochement des données sur les centres. Sélectionnez « Sources de données ».

source: Select Remote Source
fr: Sélectionnez la source à distance

source: In the Add New Remote Source form, put in the following:
fr: Dans le formulaire d'ajout de nouvelle source à distance, procédez ainsi :

source: Click Add.
fr: Cliquez sur Ajouter.

source: Sync
fr: Synchro

source: Select View Data Sources from the Data Sources tab.
fr: Sélectionnez Voir sources de données dans l'onglat Sources de données.

source: The data will not be pulled from DHIS2 unless you Force Sync or Sync Update.
fr: Les données ne seront extraites de DHIS2 à moins que vous ne procédiez à une synchrnisation forcée ou à une mise à jour de la syncrhonisation.

source: Click next to the DHIS source you added to select it.
fr: Cliquez à côté de la source DHIS que vous avez ajoutée pour la sélectionner.

source: Click Sync Update.
fr: Cliquez sur Mise à jour de la synchronisation.

source: The Facility Reconciliation Tool will now add the data from the DHIS2 source. To continue, add another another data source or if there is already one you wish to match, then create a data pair.
fr: L'outil de rapprochement sera maintenant ajouté aux données de la source DHIS2. Pour continuer, ajoutez une autre source de données ou s'il y en a déjà une que vous souhaitez utiliser, créez une paire de données.
