Repository: ashaban/gofr-tz
Catalog: docs/source/locales/*/LC_MESSAGES/user/match.po
Languages: fr

source: Match
fr: Couplage

source: Note that there is a video tutorial on how to match on the OpenHIE YouTube channel and a quick start in this documentation.
fr: Veuillez noter qu'il existe, sur la chaîne YouTube Open HIE, un tutoriel vidéo sur la manière de coupler, ainsi qu'un démarrage rapide dans la présente documentation.

source: Reconciling data sources involves choosing a pair of sources to work with and then running the automatic or manual matching tool. Any kind of match can be undone.
fr: Le rapprochement des sources de données implique le choix d'une paire de sources avec lesquelles travailler, puis le lancement de l'outil de couplage automatique ou manuel. Tout couplage peut être défait.

source: Pair sources
fr: Couplage de sources

source: Under the Reconcile tab is the Create and Manage Data Source page. On the pair tab select one source on the left and one on the right. The source on the left (source 1) is the leader -- the source of truth. The source on the right is the follower, the source that is meant to be cleaned.
fr: Sous l'onglet de rapprochement sur la page de création et de gestion des sources de données. Sous l'onglet des paires, sélectionnez une source à gauche et une source à droite, la source de gauche (la source 1) est la source leader, celle de la vérité. La source de droite est la source suiveuse, celle qui est doit être nettoyée.

source: In the pairing process it is possible to share the pair with another user who may join in helping to match, for example where they are familiar with a specific area.
fr: Dans le cadre du processus de couplage, il est possible de partager la paire avec un autre utilisateur susceptible de contribuer à l'exercice de rapprochement, par exemple, lorsqu'il s'agit d'une personne qui connaît bien le lieu.

source: Automatic matching
fr: Couplage automatique

source: When the reconciliation process starts it uses automatic matching. Matching proceeds like this:
fr: Lorsque le processus de rapprochement démarre, il utilise le couplage automatique. Le couplage se fait ainsi :

source: The first level matches the highest administrative area names (termed region in the tool) using the Levenshtein distance.
fr: Le premier niveau rapproche les noms des zones administratives les plus élevées (intitulées régions pour les besoins de cet outil) à l'aide de la distance de Levenshtein.

source: The second level matches based on the first level and also the Levenshtein distance for the second level names, termed district in the tool.
fr: Le couplage au deuxième niveau se fait sur la base du premier niveau, ainsi que de la distance de Levenshtein pour les noms de deuxième niveau, appelés districts pour les besoins de l'outil.

source: The final level matches based on the second level (which was already matched according to the level above it) as well as the Levenshtein distance.
fr: Les couplages de derniers niveaux sont basés sur ceux du deuxième niveau (qui se basaient déjà sur le niveau supérieur) ainsi que sur la distance de Levenshtein.

source: Recalculate scores
fr: Recalculer les scores

source: During the matching process at any level, it is possible to ask the tool to match unmatched entities using the Recalculate Scores button. This process does not remove matches.
fr: Lors du processus de couplage à tout niveau, il est possible de demander à l'outil de coupler des entité non couplées à l'aide du bouton de recalcu des scores. Ce processus ne retire pas les paires.

source: One common use for this is afer manual matching of any entities, to rerun the matching process and incorporate the results. This can also be used when an entity is is freed for matching after having been previously flagged.
fr: Une des utilisations courantes de cela est le couplage manuel d'entités, quelles qu'elles soient, pour réexécuter le processus de couplage et incorporer les résultats. Cela peut également être utilisé lorsqu'une entité est libérée d'un couplage après avoir été préalablement signalée.

source: Manual matching
fr: Couplage manuel

source: Manual matching brings up a dialog box to choose options. If latitude and longitude coordinates were provided in the data sources, it additionally scores matches based on the haversine formula for shortest path across a sphere (geodesic distance) between the points. This is not used in the automatic matching but is provided for manual matching.
fr: Le couplage manuel fait apparaître une fenêtre de dialogue pour le choix des options. Si les coordonnées géographiques (latitude et longitude) ont été fournies dans les sources de données, le couplage se base en outre sur la formule de haversine pour déterminer la distance la plus faible sur une sphère (distance géodésique) entre les points. Cette fonctionnalité n'est pas utilisée dans le cadre du couplage automatique mais elle est proposée pour le couplage manuel.

source: Any administrative area or facility match may be broken. If this is desired, click Recalculate Scores to rebuild the scoring index and manually match or flag as desired.
fr: Tout couplage de domaines administratifs ou de centres peut être brisé. Si c'est ce que vous souhaitez, cliquez sur « Recalculer les scores afin de recréer l'index de score et coupler de manière manuelle ou indiquer ce que vous souhaitez.

source: Parent constraints
fr: Contraintes parents

source: The default is to match facilities between sources based on hierarchies only. This means that if a facility is in the wrong nested administrative level, it will not be matched.
fr: Le processus par défaut consiste à coupler des centres entre des sources basées sur des hiérarchies uniquement. Cela signifie que tout centre se trouvant dans un niveau administratif imbriqué incorrect ne sera pas couplé.

source: Under the Configure System tab the parent constraint can be disabled to allow for matching of all facilities across the sources.
fr: Sous l'onglet de configuration du système, la contrainte parent peut être désactivée afin de permettre le couplage de tous les centres sur toutes les sources.

source: Reconcile without levels
fr: Rapprochement sans niveaux

source: It is possible to match facilities from a flat list with no hierarchies.
fr: Il est possible de coupler des centres à partir d'une liste plate sans hiérarchie.

source: When admins share a set of facilities for matching to a data manager, the data manager is notified by email when the matching is completed.
fr: Lorsque les administrateurs partagent un ensemble de centres à coupler avec le responsable des données, ce dernier est averti par e-mail lorsque le couplage est terminé.

source: Flagging
fr: Signalement

source: Flagging allows for an export of facilities that require further examination and research. When a flag is set, the user may also include a comment.
fr: Le signalement permet d'exporter les centres qui exigent un examen et des recherches plus approfondis. Lorsqu'un signalement est réalisé, l'utilisateur peut également inclure un commentaire.

source: Flags may be set on any entity. For example, an organizational unit or a facility.
fr: Les signalements peuvent porter sur n'importe quelle entité. Par exemple, une unité organisationnelle ou un centre.

source: In order to see flagged items and their comments click the FLAGGED tab on the bottom of the RECONCILE menu for the level of interest. In this example, an org unit is flagged.
fr: Pour voir les éléments signalés et les commentaires qui leur sont associés, cliquez sur l'onglet des signalements au bas du menu de rapprochement pour le niveau d'intérêt. Dans cet exemple, une unité organisationnelle a été signalée.

source: Also in this example, once flagged, a facility or administrative unit may be released back for matching to another entity, or the match that was flagged may be confirmed.
fr: Dans cet exemple, en outre, lorsqu'un centre ou une unité administrative ont été signalés, ils peuvent être libérés pour faire l'objet d'un couplage avec une autre entité ou le couplage signalé peut être confirmé.
