Repository: ashaban/gofr-tz
Catalog: site/source/locales/*/LC_MESSAGES/dev/terraform.po
Languages: fr

source: This is an example Terraform remote installation on a VM provided by Digital Ocean. See the /packaging/terraform directory for the example configuration.
fr: Il s'agit d'un exemple d'installation de Terraform à distance sur une mémoire virtuelle fournie par Digital Ocean. Cf. répertoir /packaging/terraform pour l'exemple de configuration.

source: Create an account on DO and upload a public SSH key and note your API token.
fr: Créer un compte

source: Export a DIGITALOCEAN_TOKEN variable with your API token.
fr: Exporter une variable DIGITALOCEAN-TOKEN avec votre jeton API.

source: Get the hash fingerprint that DO generated for your SSH key (this is a DO thing).
fr: Obtenez l'empreinte de hachage que DO a générée pour votre clé SSH (dépend de DO).

source: Export a TF_VAR_fingerprint variable with the hash.
fr: Exportez une variable TF_VAR_fingerprint avec le hachage.

source: Get the latest droplet instances and sizes, you'll need the awesome jq parser for JSON installed.
fr: Prenez connaissance des instances et de la taille des dernières gouttelettes, il faudra que le super parseur jq pour JSON soit installé.

source: Adjust droplet config as you wish using info from the above.
fr: Ajuster la configuration

source: Profit!
fr: Profitez-en !

source: You should be able to ssh as root if the public key was set correctly (this is the default of DO).
fr: Vous devriez pouvoir utiliser ssh comme racine si la clé a été configurée correctement (configuration par défaut de DO).

source: Clean up.
fr: Nettoyer.
