Repository: ashaban/gofr-tz
Catalog: source/locales/*/LC_MESSAGES/user/users.po
Languages: fr

source: Users and sharing
fr: Utilisateurs et partage

source: There are two classes of users, admin and data managers. The initial server configuration includes an administrator role. This account and password should be immediately changed after installation. See the Developer Guide for more information.
fr: Il existe deux catégories d'utilisateurs, les admins et les gestionnaires de données. La configuration initiale du serveur inclut un rôle d'administrateur. Ce compte et son mot de passe doivent être immédiatement modifiés à la suite de l'installation. Cf. Guide du développeur pour plus de renseignements.

source: Roles
fr: Rôles

source: Admin accounts can add users, configure the system, and all tasks of data managers.
fr: Les comptes d'admin peuvent ajouter des utilisateurs, configurer le système et réaliser toutes les tâches des gestionnaires de données.

source: Data manager accounts can manage data only. They can share data sources and do other matching tasks.
fr: Les comptes de gestionnaires de données ne peuvent que gérer les données. Ils peuvent partager les sources de donner et réaliser d'autres tâches de couplage.

source: Custom accounts with specific roles may be created in the future. Please let the community know if you have use cases for custom account roles.
fr: Des comptes personnalisés avec des rôles donnés peuvent être créés à l'avenir. Veuillez informer la communauté de tout cas d'utilisation nécessistant des rôles de comptes personnalisés.

source: Self-registration
fr: Auto-inscription

source: Administrators may configure the system to allow for anyone to self-register. This is under the Configure System tab. This option is off by default.
fr: Les administrateurs peuvent configurer le système de manière à permettre à quiconque de s'auto-enregistrer. Cela se trouve sous l'onglet de configuration du système. Cette option est désactivée par défaut.

source: Share a data source
fr: Partager une source de données

source: Data sources may be shared by location to others or entirely.
fr: Les sources de données peuvent être partagées par lieu avec d'autres ou entièrement.

source: On the Data Sources tab, select View Data Sources.
fr: Sous l'onglet de Sources de données, sélectionnez voir les sources de données.

source: Select the Share button on the far right.
fr: Sélectionnez le bouton de partage tout à fait à droite.

source: This brings up a dialog to share data sources by user and location.
fr: Une fenêtre de dialogue apparaît alors pour vous permettre de partager les sources de données par utilisateur et lieu.

source: Add to a Pair
fr: Ajouter à une paire

source: Data managers and administrators are able to add other users to help with reconciliation. To do so, the data source pairing has an option to share the pairing with another user.
fr: Les responsables des données et les administrateurs sont en mesure d'ajouter d'autres utilisateurs pour qu'ils contribuent au travail de rapprochement. Pour ce faire, le couplage des sources de données dispose d'une option de partage du couplage avec un autre utilisateur.

source: Password reset
fr: Modifier le mot de passe

source: Under the Accounts tab a user password can be reset. The reset password is the user's surname exactly as it was entered including case.
fr: Sous l'onglet des Comptes, il est possible de réinitialiser le mot de passe d'un utilisateur. Le mot de passe de réinitialisation est le nom de famille de l'utilisateur tel qu'il a été saisi, y compris les majuscules.
