Repository: ashaban/gofr-tz
Catalog: docs/source/locales/*/LC_MESSAGES/quick/quick-fake.po
Languages: fr

source: Example data
fr: Données d'exemple

source: Download the example data
fr: Téléchargez les données d'exemple

source: Go to the example workbook for Fakeland Health Facilities data.
fr: Consultez la fiche exemple pour les données du Centre de soins de Fauxpays.

source: There are two worksheets inside (see the tabs at the bottom), one for Source 1 NGO and one for Source 2 DHIS2. These are fake data for use in the tool.
fr: Il y a deux fiches de travail à l'intérieur (cf. onglets au bas), une pour la Source ONG 1 et une pour la Source 2 DHIS2. Il s'agit de données fictives à utiliser avec l'outil.

source: Download each tab as a separate CSV files to your computer by clicking under the File menu and choosing Download as: Comma-separated values
fr: Téléchargez chaque onglet comme fichier CSV séparé sur votre ordinateur en cliquant sur le menu Fichier et en choisissant Télécharger comme; valeurs séparées par des virgules

source: Save the files to your computer in an easily accessible folder.
fr: Sauvegardez les fichiers sur votre ordinnateur dans un dossier facile d'accès.

source: Upload Data
fr: Téléchargez les données.

source: Go to the reconciliation tool from the site: https://facilitymatch.org and click DEMO. You will be shown a disclaimer. If you agree, then click to continue.
fr: Accédez à l'outil de rapprochement à partir du site : http://facility.org et cliquez sur DEMO. Vous verrez un avis de non-responsabilité. Si vous l'acceptez, veuillez cliquer sur continuer.

source: On the hosted version, login using demo:demo for user:password.
fr: Dans la version hébergée, connectez-vous en utilisant demo:demo pour utilisateur:motdepasse.

source: On the site, choose Add Source in the top center of the page and select Upload CSV.
fr: Sur le site, choisissez Ajouter une source en haut de la page au centre et sélectionnez Télécharger CVS.

source: Name the upload as desired and click Upload CSV. Select the Fakeland Health Facilities - Source 1 NGO file from where you saved it on your computer.
fr: Donnez le nom de votre choix au téléchargement et cliquez sur Téléchargement CSV. Sélectionnez le fichier Centres de soins de Fauxpays - Source 1 ONG là où vous l'avez sauvegardé sur votre ordinateur.

source: Click Continue. The data will be loaded into the system.
fr: Cliquez pour continuer. Les données seront téléchargées dans le système.

source: You will be in a new dialog that asks you to assign headers for facility name, facility ID code, and administrative levels. Please select the correct headers from the dropdown menu as indicated in the screenshot below.
fr: Vous vous trouverez dans une nouvelle fenêtre de dialogue qui vous demande d'affecter des entêtes pour le nom du centre, le code identifiant du centre et les niveaux administratifs. Veuillez sélectionner les entêtes qui conviennent dans le menu déroulant comme indiqué sur la capture d'écran ci-dessous.

source: Click the blue Upload button.
fr: Cliquez sur le bouton bleu de téléchargement.

source: Repeat the above steps for uploading data but this time call the upload DHIS2 and choose the file Fakeland Health Facilities - Source 2 DHIS2 file on your computer.
fr: Procédez à nouveau aux étapes ci-dessus pour télécharger les données mais cette fois-ci donnez le nom de DHIS2 au téléchargement et choisissez le fichier Centre de soins de Fauxpays - Source 2 DHIS2 sur votre ordinnateur.

source: You should now have two data sources.
fr: Vous devriez maintenant avoir deux sources de données.
