Repository: ashaban/gofr-tz
Catalog: docs/source/locales/*/LC_MESSAGES/quick/quick-match.po
Languages: fr

source: Match data sources
fr: Mise en correspondance des données

source: To match facility lists the steps are to first create a pair of data sources and then to do the reconciliation starting at the highest level and going down the hierarchy to the last level.
fr: Le couplage des listes de centres consiste tout d'abord à créer une paire de sources de données et puis de procéder au rapprochement en commençant par le niveau le plus élevé et en descendant dans la hiérarchie jusqu'au dernier niveau.

source: Pair data sources
fr: Couplage des données

source: Go to the Reconcile tab and choose Create and Manage Data Source Pair. Select both data sources. The data source you select under Source 1 source of truth. The data source you select under Source 2 is the one that you want to fix.
fr: Cliquez sur l'onglet de rapprochement et choisissez Créer et gérer une paire de sources de données. Sélectionnez les deux sources de données. La source de données qui vous choisissez comme Source 1 est la vérité. La source de données que vous sélectionnez comme Source 2 est celle que vous souhaitez corriger.

source: Choose DHIS2 as Source 1 and NGO as Source 2.
fr: Choisissez DHIS2 comme Source 1 et ONG commes Source 2.

source: Click Save and you will be taken to the Reconcile page.
fr: Cliquez sur Sauvegarder et vous serez envoyé sur la page de rapprochement.

source: Note. After saving the pair should be active. If not, then below the pair choose Active under Existing Data Source Pairs. Then click Activate Pair.
fr: N.B. : Après la sauvegarde, la paire devrait être active. Si ce n'est pas le cas, choisissez, « Active sous paires de données existantes », puis cliquez sur « Activer la paire ».

source: Reconciliation
fr: Rapprochement

source: There are only two regions (the top administrative level in the fakeland data). They are automatically matched. The status wheels labeled Matched indicate that 2 of 2 regions have been matched. In the bottom portion of the screenshot below, you can also see that for Level 1 there is 100% match, as the two locations in Source 1 match the two locations in Source 2.
fr: Il n'existe que deux régions (le niveau administratif le plus élevé des données de Fauxpays). Elles seront automatiquement mises en correspondance. L'indicateur de statut intitulé COUPLÉ indique que 2 des 2 régions ont été couplées. Dans la partie inférieure de la capture d'écran ci-dessous, vous pouvez également voir que pour le Niveau 1, la correspondance est de 100 %, dans la mesure où les deux emplacements de la Source 1 correspondent aux deux emplacements de la Source 2.

source: Near the bottom left click Proceed to District to continue.
fr: En bas à gauche, cliquez sur District pour continuer.

source: At Level 2, the districts will automatically be matched. Click Proceed to Facility to continue.
fr: Au Niveau 2, les districts seront automatiquement mis en correspondance. Cliquez sur Accès au centre pour continuer.

source: Click Proceed to Level 3.
fr: Cliquez sur Passer au Niveau 3.

source: At Level 3, some facilities will not match.
fr: Au Niveau 3, certains centres ne seront pas couplés.

source: There is a list of unmatched facilities in the light green box for Source 1.
fr: Une liste de centres sans centre correspondant se trouve dans la boîte de dialogue vert clair pour la Source 1.

source: Select one of the facilities, like General Referral Hospital.
fr: Sélectionnez un des centres, tel que l'Hôpital de référence générale.

source: A pop-up dialog will let you choose which facility to match it to.
fr: Une fenêtre de dialogue pop-up vous permettra de choisir le centre qui lui correspond.

source: Select the most appropriate match, in this case it is Referral Hospital, and click Save Match.
fr: Sélectionnez le couplage le mieux adapté, dans ce cas-ci, il s'agit de l'hôpital de référence, et cliquez sur Sauvegarder couplage.

source: Go through the unmatched facilities in Source 1, select and save the best matches. One you are done, you will see:
fr: Passez en revue les centres non couplés sous Source 1, sélectionnez et sauvegardez les meilleurs couplages. Une fois que vous aurez fini, vous verrez :

source: The Source 1 Reconciliation Status, in the top left-hand status box, should be 100%.
fr: Le Statut de rapprochement de la Source 1, dans la boîte de statut en haut à gauche, doit indiquer 100 %.

source: Export a reconciliation report
fr: Exporter le rapport de rapprochement

source: On the top left of the reconciliation tab there is an option to output either a FHIR-based report of the final reconciled dataset or a CSV of what matched and did not match in either dataset. Choose CSV Export. You will be able to choose three files of matches and unmatches.
fr: En haut à gauche de l'onglet de rapprochement, se trouve une option pour la production d'un rapport des ensembles de données rapprochées basé sur FHIR ou d'un fichier CSV de ce qui correspond et ce qui ne correspond pas dans chacun des ensembles de données. Choisissez Exporter CSV. Vous serez alors en mesure de choisir trois fichiers de correspondances et non correspondances.

source: View reconciliation status
fr: Consultez le statut du rapprochement

source: Select Reconciliation Status and view the overall status.
fr: Sélectionnez Statut du rapprochement et voyez le statut global.
